Repository: SAP/macOS-enterprise-privileges
Catalog: source/Privileges/*.lproj/Localizable.strings
Languages: de, es, fr, it, nl, pl, ru, zh_hans

# requestButton
source: Request privileges
de: Administratorrechte erhalten
es: Solicitar Privilegios
fr: Demander les droits
it: Richiedi privilegi
nl: Vraag Privileges aan
pl: Zarządaj uprawnień
ru: Присвоить права администратора
zh_hans: 本地管理员

# removeButton
source: Remove privileges
de: Administratorrechte entfernen
es: Quitar Privilegios
fr: Retirer les droits
it: Rimuovi privilegi
nl: Verwijder Privileges
pl: Oddaj uprawnienia
ru: Удалить права администратора
zh_hans: 标准用户

# cancelButton
source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
nl: Annuleer
pl: Anuluj
ru: Отменить
zh_hans: 取消

# okButton
source: OK
ru: Сохранить
zh_hans: 确定

# notificationText_Error
source: Privileges have not been changed due to an error!
de: Die Rechte konnten wegen eines Fehlers nicht geändert werden!
es: ¡Los privilegios no se han podido cambiar debido a un error!
fr: Les droits n'ont pas été modifiés suite à une erreur!
it: I privilegi non sono stati modificati a causa di un errore!
nl: Privileges zijn niet gewijzigd vanwege een fout!
pl: Uprawnienia nie zostały nadane ze względu na błąd!
ru: Ошибка! Права доступа не были изменены.
zh_hans: 报错：目前权限不能更改!

# notificationText_Nothing
source: Privileges have not been changed.
de: Die Rechte wurden nicht geändert.
es: Los privilegios no se han cambiado.
fr: Les droits n'ont pas été modifiés.
it: I privilegi non sono stati modificati.
nl: Privileges zijn niet gewijzigd.
pl: Uprawnienia nie zostały nadane.
ru: Права доступа не были изменены.
zh_hans: 权限没有更改。

# notificationText_Success
source: Privileges have been changed successfully.
de: Die Rechte wurden erfolgreich geändert.
es: Los privilegios se han cambiado con exito.
fr: Les droits ont été modifiés avec succès.
it: I privilegi sono stati modificati con successo.
nl: Privileges zijn succesvol gewijzigd.
pl: Uprawnienia zostały nadane.
ru: Права доступа были успешно изменены.
zh_hans: 权限更改成功。

# rootError
source: You cannot run this app as root!
de: Sie können dieses Programm nicht als root-Benutzer ausführen!
es: ¡No se puede ejecutar esta aplicación como usuario root!
fr: Vous ne pouvez exécuter cette applications en tant que root!
it: Non è possibile eseguire questa applicazione come root!
nl: Deze App kan niet als root gebruiker draaien!
pl: Nie można uruchamiać tej aplikacji jako root!
ru: Программа не может быть запущена привилегированным пользователем!
zh_hans: 您不能以root身份运行该应用!

# setDialog1
source: You are currently a standard user.
de: Sie sind momentan ein Standardbenutzer.
es: Actualmente esta como usuario estandar.
fr: Vous être un utilisateur standard.
it: Al momento sei un utente standard.
nl: Je bent momenteel een standaard gebruiker.
pl: Aktualnie posiadasz uprawnienia zwykłego użytkownika.
ru: В настоящее время Вы не обладаете правами администратора.
zh_hans: 目前您是一个标准用户。

# setDialog2
source: Would you like to request administrator privileges?
de: Möchten Sie Administratorrechte erhalten?
es: ¿Le gustaría solicitar privilegios de administrador?
fr: Souhaitez-vous demander des droits administrateur?
it: Vuoi richiedere i privilegi di amministratore?
nl: Wil je Administrator privileges aanvragen?
pl: Czy chcesz zarządać uprawnień administratora?
ru: Получить права администратора?
zh_hans: 您需要申请本地管理员权限吗?

# unsetDialog1
source: You are currently an administrator.
de: Sie sind momentan Administrator.
es: Actualmente esta como usuario administrador.
fr: Vous avez des droits administrateur.
it: Al momento sei un utente amministratore.
nl: Je bent momenteel een Administrator.
pl: Aktualnie pracujesz z uprawnieniami administratora.
ru: Вы уже являетесь администратором.
zh_hans: 您现在是本地管理员。

# unsetDialog2
source: Would you like to remove administrator privileges and revert to a standard user?
de: Möchten Sie die Administratorrechte entfernen und wieder als Standardbenutzer arbeiten?
es: ¿Le gustaría quitar los privilegios de administrador y volver a usuario estandar?
fr: Souhaitez-vous retirer vos droits administrateurs et revenir à des droits d'utilisateur standard?
it: Vuoi rimuovere i privilegi di amministratore e ripristinare quelli standard?
nl: Wil je de Administrator privileges verwijderen en verder gaan als standaard gebruiker?
pl: Czy chcesz zrezygnować z uprawnień administratora i powrócić do uprawnień zwykłego użytkownika?
ru: Удалить права администратора и продолжить работу в роли стандартного пользователя?
zh_hans: 您需要移除本地管理员权限并且回到标准用户身份吗?

# restrictedDialog1
source: You cannot use this app to change your privileges!
de: Sie haben nicht die Berechtigung, dieses Programm zu benutzen!
es: No puedes usar esta aplicación para cambiar tus privilegios.
fr: Vous ne pouvez pas utiliser cette application pour changer vos privileges.
it: Non puoi usare questa applicazione per cambiare i tuoi privilegi.
nl: Je kunt deze app niet gebruiken om je privileges te wijzigen!
pl: Nie masz uprawnień aby użyć tej aplikacji do zmiany upranień!
ru: Вы не можете использовать это приложение для изменения прав доступа.
zh_hans: 您不能更改你的权限

# restrictedDialog2None
source: Your administrator has restricted the use of this app.
es: El uso de esta aplicación ha sido restringida por el administrador.
fr: Votre administrateur a limité l'utilisation de cette application.
it: L'utilizzo di questa applicazione è stato limitato dall'amministratore.
nl: Je beheerder heeft het gebruik van deze app beperkt.
pl: Administrator ograniczył możliwość używania tej aplikacji.
ru: Ваш администратор ограничил использование этого приложения.
zh_hans: 你的管理员已阻止你使用这应用程式。

# restrictedDialog2Admin
source: Your administrator has assigned you permanent administrator privileges.
de: Ihr Administrator hat Ihnen Administratorrechte dauerhaft zugewiesen.
es: Usted tiene asignados privilegios de administrador.
fr: Votre administrateur vous a attribué le droit administrateur permanent.
it: L'amministratore ti ha assegnato permanentemente i privilegi amministrativi.
nl: Je beheerder heeft je permanente administrator privileges gegeven.
pl: Administrator nadał Ci na stałe uprawnienia administracyjne.
ru: Ваш администратор долгосрочно назначил вам права администратора.
zh_hans: 你的管理员已将您设为永久管理员。

# restrictedDialog2User
source: Your administrator has assigned you permanent standard user privileges.
de: Ihr Administrator hat Ihnen die Rechte eines Standardbenutzers dauerhaft zugewiesen.
es: Usted tiene asignados privilegios de usuario regular.
fr: Votre administrateur vous a attribué le droit utilisateur standard permanent.
it: L'amministratore ti ha assegnato permanentemente i privilegi standard
nl: Je beheerder heeft je permanente standaard gebruiker privileges gegeven.
pl: Administrator nadał Ci na stałe uprawnienia zwykłego użytkownika.
ru: Ваш администратор долгосрочно назначил вам права обычного пользователя.
zh_hans: 你的管理员已将您设为永久标准用户。

# changeAdminRights
source: Privileges.app is trying to change administrator privileges for a user.
de: Privileges.app versucht die Rechte eines Benutzers zu ändern.
es: Privileges.app esta intentado cambiar los privilegios de administrador para el usuario.
fr: Privileges.app essaye de modifier les droits administrateurs pour un utilisateur.
it: Privileges.app sta cercando di cambiare i privilegi di amministratore per un utente.
nl: Privileges.app probeert de Administrator privileges te wijzigen voor een gebruiker.
pl: Privileges.app próbuje zmienić uprawnienia administracyjne dla użytkownika.
ru: Privileges.app изменит права доступа.
zh_hans: Privileges.app 正在更改用户的管理员权限！

# authenticationText
source: change administrator privileges for a user
de: versucht die Rechte eines Benutzers zu ändern
es: esta intentado cambiar los privilegios de administrador para el usuario
fr: essaye de modifier les droits administrateurs pour un utilisateur
it: sta cercando di cambiare i privilegi di Amministratore per un utente
nl: probeert de Administrator privileges te wijzigen voor een gebruiker
pl: próbuje zmienić uprawnienia administracyjne dla użytkownika
ru: изменит права доступа
zh_hans: 正在更改用户的管理员权限

# timeoutNever
source: Never
de: Nie
es: Nunca
fr: Jamais
it: Mai
nl: Nooit
pl: Nigdy
ru: Нет
zh_hans: 永不

# timeoutMin
source: minute
es: minuto
it: minuto
nl: minuut
pl: min
ru: мин
zh_hans: 分钟

# timeoutMins
source: minutes
de: Minuten
es: minutos
it: minuti
nl: minuten
pl: min
ru: мин
zh_hans: 分钟

# timeoutHour
source: hour
de: Stunde
es: hora
fr: heure
it: ora
nl: uur
pl: godz
ru: ч
zh_hans: 小时

# timeoutHours
source: hours
de: Stunden
es: horas
fr: heures
it: ore
nl: uur
pl: godz
ru: ч
zh_hans: 小时

# reasonDescription
source: Please enter the reason you need admin rights in the text field below. You must enter at least %@ to continue.
de: Bitte geben Sie im nachfolgenden Textfeld den Grund an, aus dem Sie Adminrechte benötigen. Sie müssen mindestens %@ eingeben, um fortfahren zu können.
es: Por favor, indique el motivo en el siguiente recuadro, necesitas escribir al menos %@ para continuar.
fr: Veuillez indiquer la raison pour laquelle vous avez besoin des droits d'administrateur dans le champ de texte ci-dessous. Vous devez saisir au moins %@ pour continuer.
it: Inserire la motivazione per la richiesta dei permessi di amministratore. Inserire almeno %@ per continuare.
nl: Geef hieronder een reden op waarom je admin rechten nodig hebt. Je moet minstens %@ invullen om verder te kunnen.
pl: Podaj proszę przyczyny, dla których potrzebujesz pracować z prawami administratora. Musisz podać przynajmniej %@ aby kontynuować.
ru: Укажите, пожалуйста, для чего Вам необходимы права администратора. Минимальное количество знаков: %@
zh_hans: 请输入您需要管理员权限的原因。您必须输入最少%@个字元才能继续。

# oneChar
source: one character
de: ein Zeichen
es: una carácter
fr: un caractère
it: un carattere
nl: een karakter
pl: jeden znak
zh_hans: 一个字符

# moreChars
source: %ld characters
de: %ld Zeichen
es: %ld caracteres
fr: %ld caractères
it: %ld caratteri
nl: %ld karakters
pl: %ld znaki
ru: %ld
zh_hans: %ld个字符

# evenMoreChars
source: %ld characters
de: %ld Zeichen
es: %ld caracteres
fr: %ld caractères
it: %ld caratteri
nl: %ld karakters
pl: %ld znaków
ru: %ld
zh_hans: %ld个字符

# otherMenuEntry
source: Other…
de: Anderer …
es: Otro…
fr: Autres…
it: Altro…
nl: Anders…
pl: Inne…
ru: Другое…
zh_hans: 其他

# reasonDescriptionPredefined
source: Please select the reason you need admin rights from the menu below. If you choose "%@" you must enter at least %@ to continue.
de: Bitte wählen Sie aus dem nachfolgenden Menü den Grund aus, aus dem Sie Adminrechte benötigen. Wenn Sie "%@" auswählen, müssen Sie mindestens %@ eingeben, um fortfahren zu können.
es: Por favor, seleccione el motivo para cambiar de privilegios, si elige "%@" necesita al menos %@ para continuar.
fr: Veuillez sélectionner dans le menu déroulant la raison de votre demande des droits d’Administrateur. Si vous sélectionnez "%@" vous devez entrer au moins %@ pour continuer.
it: Seleziona il motivo per cui hai bisogno dei diritti di amministratore dal menu sottostante. Se scegli "%@" devi inserire almeno %@ per continuare.
nl: Selecteer in het menu hieronder de reden waarom je admin rechten nodig hebt. Indien je "%@" selecteert moet je minstens %@ invullen om verder te kunnen.
pl: Proszę o wybranie przyczyny, dla której potrzebujesz pracować z prawami administratora. Przy wyborze opcji "%@" musisz podać przynajmniej %@ aby kontynuować.
ru: Укажите, пожалуйста, для чего вам необходимы права администратора. Минимальное количество знаков, если вы выбрали "%@": %@.
zh_hans: 请选择您需要管理员权限的原因。如果您选择「%@」，请输入原因（至少%@字元）。
